app/views/quotes/show.html.erb

SELECT "sources".* FROM "sources" WHERE "sources"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---

        <% if @quote.source.byear.present? || @quote.source.dyear.present? %>

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 11]]
---

      <% @quote.categories.each do |cat| %>