app/views/sources/index.html.erb

SELECT COUNT(*) FROM "quotes" WHERE "quotes"."source_id" = ?  [["source_id", 7]]
---
        <% end %>
        <p class="source-quote-count"><%= source.quotes.count %> quote(s)</p>