app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "quotes"
SELECT COUNT(*) FROM "sources"
SELECT COUNT(*) FROM "categories"
---
  def index
    @users = User.where(is_admin: false).order(:lname, :fname)
    @total_users = User.count
    @total_quotes = Quote.count
    @total_sources = Source.count
    @total_categories = Category.count