app/controllers/pages_controller.rb

  def home
    # Display the 10 most recently added public quotes, ordered by date descending
    @recent_quotes = Quote.recent_public.limit(10).includes(:user, :source, :categories)
    @categories = Category.order(:catname)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?, ?, ?)  [["id", 1], ["id", 10], ["id", 2], ["id", 5], ["id", 4], ["id", 3]]
SELECT "sources".* FROM "sources" WHERE "sources"."id" IN (?, ?, ?, ?, ?, ?, ?)  [["id", 7], ["id", 3], ["id", 4], ["id", 6], ["id", 5], ["id", 2], ["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "categories".* FROM "categories" ORDER BY "categories"."catname" ASC

  def search
    @categories = Category.order(:catname)
    @selected_category = Category.find_by(id: params[:category_id])

    if @selected_category
      # Return public quotes in the selected category
      @quotes = if logged_in?
        @selected_category.quotes
          .where("ispublic = ? OR user_id = ?", true, current_user.id)
          .includes(:user, :source, :categories)
          .order(created_at: :desc)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."catname" ASC
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "quotes".* FROM "quotes" INNER JOIN "quote_categories" ON "quotes"."id" = "quote_categories"."quote_id" WHERE "quote_categories"."category_id" = ? AND "quotes"."ispublic" = ? ORDER BY "quotes"."created_at" DESC  [["category_id", 5], ["ispublic", 1]]