app/controllers/quotes_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?, ?, ?, ?)  [["id", 1], ["id", 10], ["id", 2], ["id", 5], ["id", 4], ["id", 3], ["id", 7]]
SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."created_at" DESC
SELECT "sources".* FROM "sources" WHERE "sources"."id" IN (?, ?, ?, ?, ?, ?, ?)  [["id", 7], ["id", 2], ["id", 3], ["id", 4], ["id", 6], ["id", 5], ["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
  def index
    if admin_user?
      @quotes = Quote.includes(:user, :source, :categories).order(created_at: :desc)

INSERT INTO "quotes" ("qtext", "qyear", "qcom", "ispublic", "user_id", "source_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["qtext", "test"], ["qyear", ""], ["qcom", ""], ["ispublic", 1], ["user_id", 1], ["source_id", 7], ["created_at", "2026-05-22 19:57:17.239927"], ["updated_at", "2026-05-22 19:57:17.239927"]]
---
  def create
    @quote = current_user.quotes.build(quote_params)
    @selected_category_ids = params[:category_ids] || []

    # Manually check category selection BEFORE calling save
    if @selected_category_ids.empty?
      @quote.valid?
      @quote.errors.add(:base, "You must select at least one category.")
      load_sources_and_categories
      render :new, status: :unprocessable_entity
      return
    end

    if @quote.save

DELETE FROM "quote_categories" WHERE "quote_categories"."id" = ?  [["id", 20]]
---
  def update
    @selected_category_ids = params[:category_ids] || []

    # Manually check category selection BEFORE calling update
    if @selected_category_ids.empty?
      @quote.valid?
      @quote.errors.add(:base, "You must select at least one category.")
      load_sources_and_categories
      render :edit, status: :unprocessable_entity
      return
    end

    if @quote.update(quote_params)
      @quote.quote_categories.destroy_all

DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 12]]
---
  def destroy
    @quote.destroy

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def set_quote
    @quote = Quote.find_by(id: params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "quote_categories" ("quote_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["quote_id", 11], ["category_id", 5], ["created_at", "2026-05-22 19:57:17.262335"], ["updated_at", "2026-05-22 19:57:17.262335"]]
---
  def assign_categories
    selected_ids = params[:category_ids] || []
    selected_ids.each do |cat_id|
      category = Category.find_by(id: cat_id)
      @quote.quote_categories.create(category: category) if category

SELECT "sources".* FROM "sources" ORDER BY "sources"."fname" ASC
SELECT "categories".* FROM "categories" ORDER BY "categories"."catname" ASC
---
  def load_sources_and_categories
    @sources = Source.order(:fname)
    @categories = Category.order(:catname)