app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@myquotes.com"], ["LIMIT", 1]]
---
  def create
    # Find user by downcased email
    user = User.find_by(email: params[:email].downcase.strip)