app/controllers/sources_controller.rb

  def index
    @sources = Source.order(:fname)
---
SELECT "sources".* FROM "sources" ORDER BY "sources"."fname" ASC

  def show
    # Show quotes attributed to this source (only public, unless logged in as owner or admin)
    @quotes = if admin_user?
      @source.quotes.includes(:user, :categories)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 4]]
SELECT "quotes".* FROM "quotes" WHERE "quotes"."source_id" = ?  [["source_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 1]]

  def set_source
    @source = Source.find(params[:id])
---
SELECT "sources".* FROM "sources" WHERE "sources"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]