app/controllers/users_controller.rb

  def show
    @user = current_user
    @quotes = @user.quotes.includes(:source, :categories).order(created_at: :desc)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?, ?)  [["id", 10], ["id", 1], ["id", 4], ["id", 3], ["id", 5]]
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ? ORDER BY "quotes"."created_at" DESC  [["user_id", 1]]
SELECT "sources".* FROM "sources" WHERE "sources"."id" IN (?, ?, ?)  [["id", 7], ["id", 3], ["id", 4]]